In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("employee2.csv")

In [4]:
df

   eno    ename   age
0    1    nitya    20
1    2  namasvi    21
2    3     sonu    33
3    4    vidya    20
4    5    kaira
5    6     sonu    33
6    7    Shalu    20

In [16]:
df.iloc[4,2]

'    '

In [11]:
df.loc[2,'age']

'33'

In [25]:
df

   eno    ename   age
0    1    nitya    20
1    2  namasvi    21
2    3     sonu    33
3    4    vidya    20
4    5    kaira
5    6     sonu    33
6    7    Shalu    20

df[df['age'] > 21]

In [28]:
df[df["age"] >= 20]]

SyntaxError: unmatched ']' (3547193708.py, line 1)